# StructuralSectionIweldedBottomflangewidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionIweldedBottomflangewidth Property
ParameterTypeId Class See Also
---
"Bottom Flange Width"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionIweldedBottomflangewidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionIweldedBottomflangewidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionIweldedBottomflangewidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace